espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: root_clk_sel */
/** Type of soc_clk_sel register
 *  need_des
 */
typedef union {
    struct {
        /** reg_soc_clk_sel : R/W; bitpos: [1:0]; default: 0;
         *  Configures to select the clock source of HP_ROOT_CLK.
         *  0 (default): XTAL_CLK
         *  1: PLL_F300M_CLK
         *  2: RC_FAST_CLK
         */
        uint32_t reg_soc_clk_sel:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_sys_clkrst_soc_clk_sel_reg_t;


/** Group: cpu_freq_ctrl */
/** Type of cpu_freq_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cpu_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_clk_div_num:8;
        /** reg_cpu_clk_div_numerator : R/W; bitpos: [10:8]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_clk_div_numerator:3;
        /** reg_cpu_clk_div_denominator : R/W; bitpos: [13:11]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_clk_div_denominator:3;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} hp_sys_clkrst_cpu_freq_ctrl0_reg_t;


/** Group: mem_freq_ctrl */
/** Type of mem_freq_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mem_clk_div_num : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_mem_clk_div_num:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_mem_freq_ctrl0_reg_t;


/** Group: sys_freq_ctrl */
/** Type of sys_freq_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_sys_clk_div_num : R/W; bitpos: [7:0]; default: 2;
         *  need_des
         */
        uint32_t reg_sys_clk_div_num:8;
        /** reg_sys_clk_div_numerator : R/W; bitpos: [10:8]; default: 0;
         *  need_des
         */
        uint32_t reg_sys_clk_div_numerator:3;
        /** reg_sys_clk_div_denominator : R/W; bitpos: [13:11]; default: 0;
         *  need_des
         */
        uint32_t reg_sys_clk_div_denominator:3;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} hp_sys_clkrst_sys_freq_ctrl0_reg_t;


/** Group: apb_freq_ctrl */
/** Type of apb_freq_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_apb_clk_div_num : R/W; bitpos: [7:0]; default: 1;
         *  need_des
         */
        uint32_t reg_apb_clk_div_num:8;
        /** reg_apb_clk_div_numerator : R/W; bitpos: [10:8]; default: 0;
         *  need_des
         */
        uint32_t reg_apb_clk_div_numerator:3;
        /** reg_apb_clk_div_denominator : R/W; bitpos: [13:11]; default: 0;
         *  need_des
         */
        uint32_t reg_apb_clk_div_denominator:3;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} hp_sys_clkrst_apb_freq_ctrl0_reg_t;


/** Group: root_clk_ctrl */
/** Type of root_clk_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_soc_clk_update : R/W/WTC; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_soc_clk_update:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_root_clk_ctrl0_reg_t;


/** Group: cpu_wfi_delay_ctrl */
/** Type of cpu_wfi_delay_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cpuicm_delay_num : R/W; bitpos: [3:0]; default: 0;
         *  need_des
         */
        uint32_t reg_cpuicm_delay_num:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_cpu_wfi_delay_ctrl0_reg_t;


/** Group: hpcore0_ctrl */
/** Type of hpcore0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_core0_clic_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_core0_clic_clk_en:1;
        /** reg_core0_cpu_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_core0_cpu_clk_en:1;
        /** reg_core0_global_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_core0_global_rst_en:1;
        /** reg_core0_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_core0_force_norst:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_hpcore0_ctrl0_reg_t;


/** Group: hpcore1_ctrl */
/** Type of hpcore1_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_core1_clic_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_core1_clic_clk_en:1;
        /** reg_core1_cpu_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_core1_cpu_clk_en:1;
        /** reg_core1_global_rst_en : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t reg_core1_global_rst_en:1;
        /** reg_core1_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_core1_force_norst:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_hpcore1_ctrl0_reg_t;


/** Group: trace_ctrl */
/** Type of trace_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_trace_cpu_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_trace_cpu_clk_en:1;
        /** reg_trace_sys_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_trace_sys_clk_en:1;
        /** reg_trace_cpu_clk_force_on : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_trace_cpu_clk_force_on:1;
        /** reg_trace_sys_clk_force_on : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_trace_sys_clk_force_on:1;
        /** reg_trace0_rst_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_trace0_rst_en:1;
        /** reg_trace1_rst_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_trace1_rst_en:1;
        /** reg_trace0_force_norst : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t reg_trace0_force_norst:1;
        /** reg_trace1_force_norst : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_trace1_force_norst:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_sys_clkrst_trace_ctrl0_reg_t;


/** Group: tcm_ctrl */
/** Type of tcm_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_tcm_cpu_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_tcm_cpu_clk_en:1;
        /** reg_tcm_cpu_clk_force_on : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_tcm_cpu_clk_force_on:1;
        /** reg_tcm_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_tcm_rst_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_tcm_ctrl0_reg_t;


/** Group: tcmmon_ctrl */
/** Type of tcmmon_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_tcmmon_cpu_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_tcmmon_cpu_clk_en:1;
        /** reg_tcmmon_sys_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_tcmmon_sys_clk_en:1;
        /** reg_tcmmon_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_tcmmon_rst_en:1;
        /** reg_tcmmon_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_tcmmon_force_norst:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_tcmmon_ctrl0_reg_t;


/** Group: psrammon_ctrl */
/** Type of psrammon_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_psram_mon_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_mon_sys_clk_en:1;
        /** reg_psram_mon_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_mon_rst_en:1;
        /** reg_psram_mon_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_mon_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_psrammon_ctrl0_reg_t;


/** Group: rom_ctrl */
/** Type of rom_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_rom_mem_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_rom_mem_clk_en:1;
        /** reg_rom_mem_clk_force_on : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_rom_mem_clk_force_on:1;
        /** reg_rom_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_rom_rst_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_rom_ctrl0_reg_t;


/** Group: cache_ctrl */
/** Type of cache_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cpu_acache_cpu_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_cpu_acache_cpu_clk_en:1;
        /** reg_cpu_acache_cpu_clk_force_on : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_acache_cpu_clk_force_on:1;
        /** reg_cpu_acache_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_acache_rst_en:1;
        /** reg_rom_acache_mem_clk_en : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t reg_rom_acache_mem_clk_en:1;
        /** reg_rom_acache_mem_clk_force_on : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_rom_acache_mem_clk_force_on:1;
        /** reg_rom_acache_rst_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_rom_acache_rst_en:1;
        /** reg_cpu_cache_cpu_clk_en : R/W; bitpos: [6]; default: 1;
         *  need_des
         */
        uint32_t reg_cpu_cache_cpu_clk_en:1;
        /** reg_cpu_cache_cpu_clk_force_on : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_cache_cpu_clk_force_on:1;
        /** reg_cpu_cache_rst_en : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_cache_rst_en:1;
        /** reg_mspi_cache_sys_clk_en : R/W; bitpos: [9]; default: 1;
         *  need_des
         */
        uint32_t reg_mspi_cache_sys_clk_en:1;
        /** reg_mspi_cache_sys_clk_force_on : R/W; bitpos: [10]; default: 0;
         *  need_des
         */
        uint32_t reg_mspi_cache_sys_clk_force_on:1;
        /** reg_mspi_cache_rst_en : R/W; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t reg_mspi_cache_rst_en:1;
        /** reg_dcache_clk_en : R/W; bitpos: [12]; default: 1;
         *  need_des
         */
        uint32_t reg_dcache_clk_en:1;
        /** reg_dcache_rst_en : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t reg_dcache_rst_en:1;
        /** reg_icache0_clk_en : R/W; bitpos: [14]; default: 1;
         *  need_des
         */
        uint32_t reg_icache0_clk_en:1;
        /** reg_icache0_rst_en : R/W; bitpos: [15]; default: 0;
         *  need_des
         */
        uint32_t reg_icache0_rst_en:1;
        /** reg_icache1_clk_en : R/W; bitpos: [16]; default: 1;
         *  need_des
         */
        uint32_t reg_icache1_clk_en:1;
        /** reg_icache1_rst_en : R/W; bitpos: [17]; default: 0;
         *  need_des
         */
        uint32_t reg_icache1_rst_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} hp_sys_clkrst_cache_ctrl0_reg_t;


/** Group: icm_ctrl */
/** Type of icm_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_icm_cpu_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_icm_cpu_clk_en:1;
        /** reg_icm_mem_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_icm_mem_clk_en:1;
        /** reg_icm_sys_clk_en : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t reg_icm_sys_clk_en:1;
        /** reg_icm_apb_clk_en : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t reg_icm_apb_clk_en:1;
        /** reg_cpuicm_gated_clk_force_on : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_cpuicm_gated_clk_force_on:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} hp_sys_clkrst_icm_ctrl0_reg_t;


