espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: modem_ctrl */
/** Type of modem_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_modem_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_modem_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_modem_ctrl0_reg_t;


/** Group: misc_ctrl */
/** Type of misc_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_misc_cpu_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_misc_cpu_clk_en:1;
        /** reg_misc_sys_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_misc_sys_clk_en:1;
        /** reg_sysreg_apb_clk_en : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t reg_sysreg_apb_clk_en:1;
        /** reg_hp_clkrst_apb_clk_en : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t reg_hp_clkrst_apb_clk_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_misc_ctrl0_reg_t;


/** Group: busmon_ctrl */
/** Type of busmon_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_busmon_core0_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core0_clk_en:1;
        /** reg_busmon_core0_clk_force_on : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core0_clk_force_on:1;
        /** reg_busmon_core0_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core0_rst_en:1;
        /** reg_busmon_core0_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core0_force_norst:1;
        /** reg_busmon_core1_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core1_clk_en:1;
        /** reg_busmon_core1_clk_force_on : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core1_clk_force_on:1;
        /** reg_busmon_core1_rst_en : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core1_rst_en:1;
        /** reg_busmon_core1_force_norst : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_busmon_core1_force_norst:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_sys_clkrst_busmon_ctrl0_reg_t;


/** Group: remove_tmp */
/** Type of remove_tmp0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_gdma_cpu_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_gdma_cpu_clk_en:1;
        /** reg_vpu_cpu_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_vpu_cpu_clk_en:1;
        /** reg_vpu_sys_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_vpu_sys_clk_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_remove_tmp0_reg_t;


/** Group: pvt0_ctrl */
/** Type of pvt0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_pvt0_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_sys_clk_en:1;
        /** reg_pvt0_top_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_top_rst_en:1;
        /** reg_pvt0_apb_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_apb_rst_en:1;
        /** reg_pvt0_clk_div_num : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_clk_div_num:8;
        /** reg_pvt0_clk_en : R/W; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_clk_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} hp_sys_clkrst_pvt0_ctrl0_reg_t;


/** Group: pvt0_peri_ctrl */
/** Type of pvt0_peri_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_pvt0_peri_group1_rst_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_peri_group1_rst_en:1;
        /** reg_pvt0_peri_group2_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_peri_group2_rst_en:1;
        /** reg_pvt0_peri_group3_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_peri_group3_rst_en:1;
        /** reg_pvt0_peri_group4_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_pvt0_peri_group4_rst_en:1;
        /** reg_pvt0_peri_group1_clk_en : R/W; bitpos: [4]; default: 0;
         *  TOP power domain pvt clk en
         */
        uint32_t reg_pvt0_peri_group1_clk_en:1;
        /** reg_pvt0_peri_group2_clk_en : R/W; bitpos: [5]; default: 0;
         *  TOP power domain pvt clk en
         */
        uint32_t reg_pvt0_peri_group2_clk_en:1;
        /** reg_pvt0_peri_group3_clk_en : R/W; bitpos: [6]; default: 0;
         *  modem power domain pvt clk en
         */
        uint32_t reg_pvt0_peri_group3_clk_en:1;
        /** reg_pvt0_peri_group4_clk_en : R/W; bitpos: [7]; default: 0;
         *  modem power domain pvt clk en
         */
        uint32_t reg_pvt0_peri_group4_clk_en:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_sys_clkrst_pvt0_peri_ctrl0_reg_t;


/** Group: crypto_ctrl */
/** Type of crypto_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_crypto_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_sys_clk_en:1;
        /** reg_crypto_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_rst_en:1;
        /** reg_crypto_sec_clk_en : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_sec_clk_en:1;
        /** reg_crypto_sec_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_sec_rst_en:1;
        /** reg_crypto_aes_clk_en : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_aes_clk_en:1;
        /** reg_crypto_aes_rst_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_aes_rst_en:1;
        /** reg_crypto_sha_clk_en : R/W; bitpos: [6]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_sha_clk_en:1;
        /** reg_crypto_sha_rst_en : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_sha_rst_en:1;
        /** reg_crypto_rsa_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_rsa_clk_en:1;
        /** reg_crypto_rsa_rst_en : R/W; bitpos: [9]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_rsa_rst_en:1;
        /** reg_crypto_ds_clk_en : R/W; bitpos: [10]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_ds_clk_en:1;
        /** reg_crypto_ds_rst_en : R/W; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_ds_rst_en:1;
        /** reg_crypto_ecc_clk_en : R/W; bitpos: [12]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_ecc_clk_en:1;
        /** reg_crypto_ecc_rst_en : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_ecc_rst_en:1;
        /** reg_crypto_hmac_clk_en : R/W; bitpos: [14]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_hmac_clk_en:1;
        /** reg_crypto_hmac_rst_en : R/W; bitpos: [15]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_hmac_rst_en:1;
        /** reg_crypto_ecdsa_clk_en : R/W; bitpos: [16]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_ecdsa_clk_en:1;
        /** reg_crypto_ecdsa_rst_en : R/W; bitpos: [17]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_ecdsa_rst_en:1;
        uint32_t reserved_18:2;
        /** reg_crypto_clk_src_sel : R/W; bitpos: [21:20]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_clk_src_sel:2;
        /** reg_crypto_rma_clk_en : R/W; bitpos: [22]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_rma_clk_en:1;
        /** reg_crypto_rma_rst_en : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_rma_rst_en:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} hp_sys_clkrst_crypto_ctrl0_reg_t;


