espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: key_manager_ctrl */
/** Type of key_manager_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_key_manager_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_key_manager_sys_clk_en:1;
        /** reg_crypto_km_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_crypto_km_rst_en:1;
        /** reg_crypto_km_clk_en : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t reg_crypto_km_clk_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_key_manager_ctrl0_reg_t;


/** Group: dpa_ctrl */
/** Type of dpa_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_sec_dpa_level : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t reg_sec_dpa_level:2;
        /** reg_sec_dpa_cfg_sel : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_sec_dpa_cfg_sel:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_dpa_ctrl0_reg_t;


/** Group: flash_ctrl */
/** Type of flash_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_flash_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_flash_sys_clk_en:1;
        /** reg_flash_axi_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_flash_axi_rst_en:1;
        /** reg_flash_apb_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_flash_apb_rst_en:1;
        /** reg_flash_axi_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_flash_axi_force_norst:1;
        /** reg_flash_apb_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_flash_apb_force_norst:1;
        /** reg_flash_clk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  need_des
         */
        uint32_t reg_flash_clk_src_sel:2;
        /** reg_flash_pll_clk_en : R/W; bitpos: [7]; default: 1;
         *  need_des
         */
        uint32_t reg_flash_pll_clk_en:1;
        /** reg_flash_core_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_flash_core_clk_en:1;
        /** reg_flash_core_clk_div_num : R/W; bitpos: [16:9]; default: 3;
         *  need_des
         */
        uint32_t reg_flash_core_clk_div_num:8;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_flash_ctrl0_reg_t;


/** Group: psram_ctrl */
/** Type of psram_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_psram_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_psram_sys_clk_en:1;
        /** reg_psram_axi_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_axi_rst_en:1;
        /** reg_psram_apb_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_apb_rst_en:1;
        /** reg_psram_axi_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_axi_force_norst:1;
        /** reg_psram_apb_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_apb_force_norst:1;
        /** reg_psram_clk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_clk_src_sel:2;
        /** reg_psram_pll_clk_en : R/W; bitpos: [7]; default: 1;
         *  need_des
         */
        uint32_t reg_psram_pll_clk_en:1;
        /** reg_psram_core_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_psram_core_clk_en:1;
        /** reg_psram_core_clk_div_num : R/W; bitpos: [16:9]; default: 0;
         *  need_des
         */
        uint32_t reg_psram_core_clk_div_num:8;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_psram_ctrl0_reg_t;


/** Group: gpspi2_ctrl */
/** Type of gpspi2_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_gpspi2_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi2_sys_clk_en:1;
        /** reg_gpspi2_apb_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi2_apb_clk_en:1;
        /** reg_gpspi2_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi2_rst_en:1;
        /** reg_gpspi2_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi2_force_norst:1;
        /** reg_gpspi2_clk_src_sel : R/W; bitpos: [5:4]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi2_clk_src_sel:2;
        /** reg_gpspi2_hs_clk_en : R/W; bitpos: [6]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi2_hs_clk_en:1;
        /** reg_gpspi2_hs_clk_div_num : R/W; bitpos: [14:7]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi2_hs_clk_div_num:8;
        /** reg_gpspi2_mst_clk_div_num : R/W; bitpos: [22:15]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi2_mst_clk_div_num:8;
        /** reg_gpspi2_mst_clk_en : R/W; bitpos: [23]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi2_mst_clk_en:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} hp_sys_clkrst_gpspi2_ctrl0_reg_t;


/** Group: gpspi3_ctrl */
/** Type of gpspi3_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_gpspi3_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi3_sys_clk_en:1;
        /** reg_gpspi3_apb_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi3_apb_clk_en:1;
        /** reg_gpspi3_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi3_rst_en:1;
        /** reg_gpspi3_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi3_force_norst:1;
        /** reg_gpspi3_clk_src_sel : R/W; bitpos: [5:4]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi3_clk_src_sel:2;
        /** reg_gpspi3_hs_clk_en : R/W; bitpos: [6]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi3_hs_clk_en:1;
        /** reg_gpspi3_hs_clk_div_num : R/W; bitpos: [14:7]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi3_hs_clk_div_num:8;
        /** reg_gpspi3_mst_clk_div_num : R/W; bitpos: [22:15]; default: 0;
         *  need_des
         */
        uint32_t reg_gpspi3_mst_clk_div_num:8;
        /** reg_gpspi3_mst_clk_en : R/W; bitpos: [23]; default: 1;
         *  need_des
         */
        uint32_t reg_gpspi3_mst_clk_en:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} hp_sys_clkrst_gpspi3_ctrl0_reg_t;


/** Group: gdma_ctrl */
/** Type of gdma_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_gdma_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_gdma_sys_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_gdma_ctrl0_reg_t;


/** Group: axi_pdma_ctrl */
/** Type of axi_pdma_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_axi_pdma_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_axi_pdma_sys_clk_en:1;
        /** reg_axi_pdma_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_axi_pdma_rst_en:1;
        /** reg_axi_pdma_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_axi_pdma_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_axi_pdma_ctrl0_reg_t;


