espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: ahb_pdma_ctrl */
/** Type of ahb_pdma_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ahb_pdma_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_ahb_pdma_sys_clk_en:1;
        /** reg_ahb_pdma_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_ahb_pdma_rst_en:1;
        /** reg_ahb_pdma_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_ahb_pdma_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_ahb_pdma_ctrl0_reg_t;


/** Group: regdma_ctrl */
/** Type of regdma_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_regdma_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_regdma_sys_clk_en:1;
        /** reg_regdma_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_regdma_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_sys_clkrst_regdma_ctrl0_reg_t;


/** Group: uhci_ctrl */
/** Type of uhci_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_uhci_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_uhci_sys_clk_en:1;
        /** reg_uhci_apb_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_uhci_apb_clk_en:1;
        /** reg_uhci_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_uhci_rst_en:1;
        /** reg_uhci_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_uhci_force_norst:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_uhci_ctrl0_reg_t;


/** Group: uart0_ctrl */
/** Type of uart0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_uart0_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_uart0_sys_clk_en:1;
        /** reg_uart0_apb_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_uart0_apb_clk_en:1;
        /** reg_uart0_core_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_uart0_core_rst_en:1;
        /** reg_uart0_apb_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_uart0_apb_rst_en:1;
        /** reg_uart0_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_uart0_force_norst:1;
        /** reg_uart0_clk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  need_des
         */
        uint32_t reg_uart0_clk_src_sel:2;
        /** reg_uart0_clk_en : R/W; bitpos: [7]; default: 1;
         *  need_des
         */
        uint32_t reg_uart0_clk_en:1;
        /** reg_uart0_sclk_div_num : R/W; bitpos: [15:8]; default: 0;
         *  need_des
         */
        uint32_t reg_uart0_sclk_div_num:8;
        /** reg_uart0_sclk_div_numerator : R/W; bitpos: [23:16]; default: 0;
         *  need_des
         */
        uint32_t reg_uart0_sclk_div_numerator:8;
        /** reg_uart0_sclk_div_denominator : R/W; bitpos: [31:24]; default: 0;
         *  need_des
         */
        uint32_t reg_uart0_sclk_div_denominator:8;
    };
    uint32_t val;
} hp_sys_clkrst_uart0_ctrl0_reg_t;


/** Group: uart1_ctrl */
/** Type of uart1_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_uart1_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_uart1_sys_clk_en:1;
        /** reg_uart1_apb_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_uart1_apb_clk_en:1;
        /** reg_uart1_core_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_uart1_core_rst_en:1;
        /** reg_uart1_apb_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_uart1_apb_rst_en:1;
        /** reg_uart1_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_uart1_force_norst:1;
        /** reg_uart1_clk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  need_des
         */
        uint32_t reg_uart1_clk_src_sel:2;
        /** reg_uart1_clk_en : R/W; bitpos: [7]; default: 1;
         *  need_des
         */
        uint32_t reg_uart1_clk_en:1;
        /** reg_uart1_sclk_div_num : R/W; bitpos: [15:8]; default: 0;
         *  need_des
         */
        uint32_t reg_uart1_sclk_div_num:8;
        /** reg_uart1_sclk_div_numerator : R/W; bitpos: [23:16]; default: 0;
         *  need_des
         */
        uint32_t reg_uart1_sclk_div_numerator:8;
        /** reg_uart1_sclk_div_denominator : R/W; bitpos: [31:24]; default: 0;
         *  need_des
         */
        uint32_t reg_uart1_sclk_div_denominator:8;
    };
    uint32_t val;
} hp_sys_clkrst_uart1_ctrl0_reg_t;


/** Group: uart2_ctrl */
/** Type of uart2_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_uart2_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_uart2_sys_clk_en:1;
        /** reg_uart2_apb_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_uart2_apb_clk_en:1;
        /** reg_uart2_core_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_uart2_core_rst_en:1;
        /** reg_uart2_apb_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_uart2_apb_rst_en:1;
        /** reg_uart2_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_uart2_force_norst:1;
        /** reg_uart2_clk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  need_des
         */
        uint32_t reg_uart2_clk_src_sel:2;
        /** reg_uart2_clk_en : R/W; bitpos: [7]; default: 1;
         *  need_des
         */
        uint32_t reg_uart2_clk_en:1;
        /** reg_uart2_sclk_div_num : R/W; bitpos: [15:8]; default: 0;
         *  need_des
         */
        uint32_t reg_uart2_sclk_div_num:8;
        /** reg_uart2_sclk_div_numerator : R/W; bitpos: [23:16]; default: 0;
         *  need_des
         */
        uint32_t reg_uart2_sclk_div_numerator:8;
        /** reg_uart2_sclk_div_denominator : R/W; bitpos: [31:24]; default: 0;
         *  need_des
         */
        uint32_t reg_uart2_sclk_div_denominator:8;
    };
    uint32_t val;
} hp_sys_clkrst_uart2_ctrl0_reg_t;


/** Group: uart3_ctrl */
/** Type of uart3_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_uart3_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_uart3_sys_clk_en:1;
        /** reg_uart3_apb_clk_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t reg_uart3_apb_clk_en:1;
        /** reg_uart3_core_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_uart3_core_rst_en:1;
        /** reg_uart3_apb_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_uart3_apb_rst_en:1;
        /** reg_uart3_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_uart3_force_norst:1;
        /** reg_uart3_clk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  need_des
         */
        uint32_t reg_uart3_clk_src_sel:2;
        /** reg_uart3_clk_en : R/W; bitpos: [7]; default: 1;
         *  need_des
         */
        uint32_t reg_uart3_clk_en:1;
        /** reg_uart3_sclk_div_num : R/W; bitpos: [15:8]; default: 0;
         *  need_des
         */
        uint32_t reg_uart3_sclk_div_num:8;
        /** reg_uart3_sclk_div_numerator : R/W; bitpos: [23:16]; default: 0;
         *  need_des
         */
        uint32_t reg_uart3_sclk_div_numerator:8;
        /** reg_uart3_sclk_div_denominator : R/W; bitpos: [31:24]; default: 0;
         *  need_des
         */
        uint32_t reg_uart3_sclk_div_denominator:8;
    };
    uint32_t val;
} hp_sys_clkrst_uart3_ctrl0_reg_t;


