espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: parlio_ctrl */
/** Type of parlio_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_parlio_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_sys_clk_en:1;
        /** reg_parlio_apb_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_apb_clk_en:1;
        /** reg_parlio_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rst_en:1;
        /** reg_parlio_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_force_norst:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_parlio_ctrl0_reg_t;


/** Group: parlio_rx_ctrl */
/** Type of parlio_rx_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_parlio_rx_rst_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rx_rst_en:1;
        /** reg_parlio_rx_force_norst : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rx_force_norst:1;
        /** reg_parlio_rx_clk_src_sel : R/W; bitpos: [3:2]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rx_clk_src_sel:2;
        /** reg_parlio_rx_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rx_clk_en:1;
        /** reg_parlio_rx_clk_div_num : R/W; bitpos: [12:5]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rx_clk_div_num:8;
        /** reg_parlio_rx_clk_div_numerator : R/W; bitpos: [20:13]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rx_clk_div_numerator:8;
        /** reg_parlio_rx_clk_div_denominator : R/W; bitpos: [28:21]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_rx_clk_div_denominator:8;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} hp_sys_clkrst_parlio_rx_ctrl0_reg_t;


/** Group: parlio_tx_ctrl */
/** Type of parlio_tx_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_parlio_tx_rst_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_tx_rst_en:1;
        /** reg_parlio_tx_force_norst : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_tx_force_norst:1;
        /** reg_parlio_tx_clk_src_sel : R/W; bitpos: [3:2]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_tx_clk_src_sel:2;
        /** reg_parlio_tx_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_tx_clk_en:1;
        /** reg_parlio_tx_clk_div_num : R/W; bitpos: [12:5]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_tx_clk_div_num:8;
        /** reg_parlio_tx_clk_div_numerator : R/W; bitpos: [20:13]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_tx_clk_div_numerator:8;
        /** reg_parlio_tx_clk_div_denominator : R/W; bitpos: [28:21]; default: 0;
         *  need_des
         */
        uint32_t reg_parlio_tx_clk_div_denominator:8;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} hp_sys_clkrst_parlio_tx_ctrl0_reg_t;


/** Group: bitsrambler_ctrl */
/** Type of bitsrambler_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_bitsrambler_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_sys_clk_en:1;
        /** reg_bitsrambler_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_rst_en:1;
        /** reg_bitsrambler_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_force_norst:1;
        /** reg_bitsrambler_rx_sys_clk_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_rx_sys_clk_en:1;
        /** reg_bitsrambler_rx_rst_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_rx_rst_en:1;
        /** reg_bitsrambler_rx_force_norst : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_rx_force_norst:1;
        /** reg_bitsrambler_tx_sys_clk_en : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_tx_sys_clk_en:1;
        /** reg_bitsrambler_tx_rst_en : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_tx_rst_en:1;
        /** reg_bitsrambler_tx_force_norst : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t reg_bitsrambler_tx_force_norst:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_bitsrambler_ctrl0_reg_t;


/** Group: etm_ctrl */
/** Type of etm_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** reg_etm_apb_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_etm_apb_clk_en:1;
        /** reg_etm_rst_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_etm_rst_en:1;
        /** reg_etm_force_norst : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_etm_force_norst:1;
        /** reg_soc_etm_clk_sel : R/W; bitpos: [5:4]; default: 0;
         *  need_des
         */
        uint32_t reg_soc_etm_clk_sel:2;
        /** reg_soc_etm_clk_en : R/W; bitpos: [6]; default: 1;
         *  need_des
         */
        uint32_t reg_soc_etm_clk_en:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} hp_sys_clkrst_etm_ctrl0_reg_t;


/** Group: usb_otghs_ctrl */
/** Type of usb_otghs_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_usb_otghs_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_usb_otghs_apb_clk_en:1;
        /** reg_usb_otghs_sys_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_usb_otghs_sys_clk_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_sys_clkrst_usb_otghs_ctrl0_reg_t;


/** Group: dma2d_ctrl */
/** Type of dma2d_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_dma2d_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_dma2d_sys_clk_en:1;
        /** reg_dma2d_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_dma2d_rst_en:1;
        /** reg_dma2d_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_dma2d_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_dma2d_ctrl0_reg_t;


/** Group: ppa_ctrl */
/** Type of ppa_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ppa_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_ppa_sys_clk_en:1;
        /** reg_ppa_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_ppa_rst_en:1;
        /** reg_ppa_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_ppa_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_ppa_ctrl0_reg_t;


/** Group: jpeg_ctrl */
/** Type of jpeg_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_jpeg_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_jpeg_sys_clk_en:1;
        /** reg_jpeg_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_jpeg_rst_en:1;
        /** reg_jpeg_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_jpeg_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_jpeg_ctrl0_reg_t;


