espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: rmt_ctrl */
/** Type of rmt_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_rmt_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_sys_clk_en:1;
        /** reg_rmt_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_rst_en:1;
        /** reg_rmt_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_force_norst:1;
        /** reg_rmt_clk_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_clk_src_sel:2;
        /** reg_rmt_clk_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_clk_en:1;
        /** reg_rmt_clk_div_num : R/W; bitpos: [13:6]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_clk_div_num:8;
        /** reg_rmt_clk_div_numerator : R/W; bitpos: [21:14]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_clk_div_numerator:8;
        /** reg_rmt_clk_div_denominator : R/W; bitpos: [29:22]; default: 0;
         *  need_des
         */
        uint32_t reg_rmt_clk_div_denominator:8;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} hp_sys_clkrst_rmt_ctrl0_reg_t;


/** Group: sdio_host_ctrl */
/** Type of sdio_host_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_sdmmc_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_sdmmc_sys_clk_en:1;
        /** reg_sdio_hs_mode : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t reg_sdio_hs_mode:1;
        /** reg_sdio_ls_clk_src_sel : R/W; bitpos: [2]; default: 0;
         *  reserved
         */
        uint32_t reg_sdio_ls_clk_src_sel:1;
        /** reg_sdio_ls_clk_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_clk_en:1;
        /** reg_sdio_ls_clk_div_num : R/W; bitpos: [11:4]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_clk_div_num:8;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} hp_sys_clkrst_sdio_host_ctrl0_reg_t;


/** Group: sdio_host_func_ctrl */
/** Type of sdio_host_func_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_sdio_ls_clk_edge_cfg_update : WT; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_clk_edge_cfg_update:1;
        /** reg_sdio_ls_clk_edge_l : R/W; bitpos: [4:1]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_clk_edge_l:4;
        /** reg_sdio_ls_clk_edge_h : R/W; bitpos: [8:5]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_clk_edge_h:4;
        /** reg_sdio_ls_clk_edge_n : R/W; bitpos: [12:9]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_clk_edge_n:4;
        /** reg_sdio_ls_slf_clk_edge_sel : R/W; bitpos: [15:13]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_slf_clk_edge_sel:3;
        /** reg_sdio_ls_drv_clk_edge_sel : R/W; bitpos: [18:16]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_drv_clk_edge_sel:3;
        /** reg_sdio_ls_sam_clk_edge_sel : R/W; bitpos: [21:19]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_sam_clk_edge_sel:3;
        /** reg_sdio_ls_slf_clk_en : R/W; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_slf_clk_en:1;
        /** reg_sdio_ls_drv_clk_en : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_drv_clk_en:1;
        /** reg_sdio_ls_sam_clk_en : R/W; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_ls_sam_clk_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_sys_clkrst_sdio_host_func_ctrl0_reg_t;


/** Group: emac_ctrl */
/** Type of emac_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_emac_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_emac_sys_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_emac_ctrl0_reg_t;


/** Group: dsi_ctrl */
/** Type of dsi_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_dsi_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_dsi_sys_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_dsi_ctrl0_reg_t;


/** Group: dsi_phy_ctrl */
/** Type of dsi_phy_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mipi_dsi_dphy_clk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t reg_mipi_dsi_dphy_clk_src_sel:2;
        /** reg_mipi_dsi_dphy_cfg_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_mipi_dsi_dphy_cfg_clk_en:1;
        /** reg_mipi_dsi_dphy_pll_refclk_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_mipi_dsi_dphy_pll_refclk_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_dsi_phy_ctrl0_reg_t;


/** Group: dsi_dpi_ctrl */
/** Type of dsi_dpi_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mipi_dsi_dpiclk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t reg_mipi_dsi_dpiclk_src_sel:2;
        /** reg_mipi_dsi_dpiclk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_mipi_dsi_dpiclk_en:1;
        /** reg_mipi_dsi_dpiclk_div_num : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_mipi_dsi_dpiclk_div_num:8;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_sys_clkrst_dsi_dpi_ctrl0_reg_t;


/** Group: mspi_pad_ctrl */
/** Type of mspi_pad_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mspi_pad_ctrl_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_mspi_pad_ctrl_apb_clk_en:1;
        /** reg_mspi_pad_ctrl_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_mspi_pad_ctrl_rst_en:1;
        /** reg_mspi_pad_ctrl_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_mspi_pad_ctrl_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_mspi_pad_ctrl0_reg_t;


