espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: i2c0_ctrl */
/** Type of i2c0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2c0_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_apb_clk_en:1;
        /** reg_i2c0_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_rst_en:1;
        /** reg_i2c0_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_force_norst:1;
        /** reg_i2c0_clk_src_sel : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_clk_src_sel:1;
        /** reg_i2c0_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_clk_en:1;
        /** reg_i2c0_clk_div_num : R/W; bitpos: [12:5]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_clk_div_num:8;
        /** reg_i2c0_clk_div_numerator : R/W; bitpos: [20:13]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_clk_div_numerator:8;
        /** reg_i2c0_clk_div_denominator : R/W; bitpos: [28:21]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c0_clk_div_denominator:8;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} hp_sys_clkrst_i2c0_ctrl0_reg_t;


/** Group: i2c1_ctrl */
/** Type of i2c1_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2c1_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_apb_clk_en:1;
        /** reg_i2c1_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_rst_en:1;
        /** reg_i2c1_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_force_norst:1;
        /** reg_i2c1_clk_src_sel : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_clk_src_sel:1;
        /** reg_i2c1_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_clk_en:1;
        /** reg_i2c1_clk_div_num : R/W; bitpos: [12:5]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_clk_div_num:8;
        /** reg_i2c1_clk_div_numerator : R/W; bitpos: [20:13]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_clk_div_numerator:8;
        /** reg_i2c1_clk_div_denominator : R/W; bitpos: [28:21]; default: 0;
         *  need_des
         */
        uint32_t reg_i2c1_clk_div_denominator:8;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} hp_sys_clkrst_i2c1_ctrl0_reg_t;


/** Group: i2s0_ctrl */
/** Type of i2s0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s0_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_apb_clk_en:1;
        /** reg_i2s0_apb_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_apb_rst_en:1;
        /** reg_i2s0_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_i2s0_ctrl0_reg_t;


/** Group: i2s0_rx_ctrl */
/** Type of i2s0_rx_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s0_rx_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_rx_clk_en:1;
        /** reg_i2s0_rx_clk_src_sel : R/W; bitpos: [2:1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_rx_clk_src_sel:2;
        /** reg_i2s0_rx_div_n : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_rx_div_n:8;
        /** reg_i2s0_mst_clk_sel : R/W; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_mst_clk_sel:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} hp_sys_clkrst_i2s0_rx_ctrl0_reg_t;


/** Group: i2s0_rx_div_ctrl */
/** Type of i2s0_rx_div_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s0_rx_div_x : R/W; bitpos: [8:0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_rx_div_x:9;
        /** reg_i2s0_rx_div_y : R/W; bitpos: [17:9]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_rx_div_y:9;
        /** reg_i2s0_rx_div_z : R/W; bitpos: [26:18]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_rx_div_z:9;
        /** reg_i2s0_rx_div_yn1 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_rx_div_yn1:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_sys_clkrst_i2s0_rx_div_ctrl0_reg_t;


/** Group: i2s0_tx_ctrl */
/** Type of i2s0_tx_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s0_tx_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_tx_clk_en:1;
        /** reg_i2s0_tx_clk_src_sel : R/W; bitpos: [2:1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_tx_clk_src_sel:2;
        /** reg_i2s0_tx_div_n : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_tx_div_n:8;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_sys_clkrst_i2s0_tx_ctrl0_reg_t;


/** Group: i2s0_tx_div_ctrl */
/** Type of i2s0_tx_div_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s0_tx_div_x : R/W; bitpos: [8:0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_tx_div_x:9;
        /** reg_i2s0_tx_div_y : R/W; bitpos: [17:9]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_tx_div_y:9;
        /** reg_i2s0_tx_div_z : R/W; bitpos: [26:18]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_tx_div_z:9;
        /** reg_i2s0_tx_div_yn1 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s0_tx_div_yn1:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_sys_clkrst_i2s0_tx_div_ctrl0_reg_t;


/** Group: i2s1_ctrl */
/** Type of i2s1_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s1_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_apb_clk_en:1;
        /** reg_i2s1_apb_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_apb_rst_en:1;
        /** reg_i2s1_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_i2s1_ctrl0_reg_t;


/** Group: i2s1_rx_ctrl */
/** Type of i2s1_rx_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s1_rx_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_rx_clk_en:1;
        /** reg_i2s1_rx_clk_src_sel : R/W; bitpos: [2:1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_rx_clk_src_sel:2;
        /** reg_i2s1_rx_div_n : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_rx_div_n:8;
        /** reg_i2s1_mst_clk_sel : R/W; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_mst_clk_sel:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} hp_sys_clkrst_i2s1_rx_ctrl0_reg_t;


/** Group: i2s1_rx_div_ctrl */
/** Type of i2s1_rx_div_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s1_rx_div_x : R/W; bitpos: [8:0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_rx_div_x:9;
        /** reg_i2s1_rx_div_y : R/W; bitpos: [17:9]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_rx_div_y:9;
        /** reg_i2s1_rx_div_z : R/W; bitpos: [26:18]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_rx_div_z:9;
        /** reg_i2s1_rx_div_yn1 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_rx_div_yn1:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_sys_clkrst_i2s1_rx_div_ctrl0_reg_t;


/** Group: i2s1_tx_ctrl */
/** Type of i2s1_tx_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s1_tx_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_tx_clk_en:1;
        /** reg_i2s1_tx_clk_src_sel : R/W; bitpos: [2:1]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_tx_clk_src_sel:2;
        /** reg_i2s1_tx_div_n : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_tx_div_n:8;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_sys_clkrst_i2s1_tx_ctrl0_reg_t;


/** Group: i2s1_tx_div_ctrl */
/** Type of i2s1_tx_div_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_i2s1_tx_div_x : R/W; bitpos: [8:0]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_tx_div_x:9;
        /** reg_i2s1_tx_div_y : R/W; bitpos: [17:9]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_tx_div_y:9;
        /** reg_i2s1_tx_div_z : R/W; bitpos: [26:18]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_tx_div_z:9;
        /** reg_i2s1_tx_div_yn1 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t reg_i2s1_tx_div_yn1:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_sys_clkrst_i2s1_tx_div_ctrl0_reg_t;


/** Group: twai0_ctrl */
/** Type of twai0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_twai0_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_twai0_apb_clk_en:1;
        /** reg_twai0_clk_src_sel : R/W; bitpos: [2:1]; default: 0;
         *  need_des
         */
        uint32_t reg_twai0_clk_src_sel:2;
        /** reg_twai0_clk_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_twai0_clk_en:1;
        /** reg_twai0_rst_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_twai0_rst_en:1;
        /** reg_twai0_force_norst : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_twai0_force_norst:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_sys_clkrst_twai0_ctrl0_reg_t;


/** Group: twai1_ctrl */
/** Type of twai1_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_twai1_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_twai1_apb_clk_en:1;
        /** reg_twai1_clk_src_sel : R/W; bitpos: [2:1]; default: 0;
         *  need_des
         */
        uint32_t reg_twai1_clk_src_sel:2;
        /** reg_twai1_clk_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_twai1_clk_en:1;
        /** reg_twai1_rst_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_twai1_rst_en:1;
        /** reg_twai1_force_norst : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_twai1_force_norst:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_sys_clkrst_twai1_ctrl0_reg_t;


/** Group: timergrp0_ctrl */
/** Type of timergrp0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_timergrp0_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp0_apb_clk_en:1;
        /** reg_timergrp0_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp0_rst_en:1;
        /** reg_timergrp0_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp0_force_norst:1;
        /** reg_timergrp0_t0_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp0_t0_src_sel:2;
        /** reg_timergrp0_t0_clk_en : R/W; bitpos: [5]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp0_t0_clk_en:1;
        /** reg_timergrp0_t1_src_sel : R/W; bitpos: [7:6]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp0_t1_src_sel:2;
        /** reg_timergrp0_t1_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp0_t1_clk_en:1;
        /** reg_timergrp0_wdt_src_sel : R/W; bitpos: [10:9]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp0_wdt_src_sel:2;
        /** reg_timergrp0_wdt_clk_en : R/W; bitpos: [11]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp0_wdt_clk_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} hp_sys_clkrst_timergrp0_ctrl0_reg_t;


/** Group: timergrp0_tgrt_ctrl */
/** Type of timergrp0_tgrt_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_timergrp0_tgrt_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp0_tgrt_clk_en:1;
        /** reg_timergrp0_tgrt_clk_src_sel : R/W; bitpos: [4:1]; default: 8;
         *  need_des
         */
        uint32_t reg_timergrp0_tgrt_clk_src_sel:4;
        /** reg_timergrp0_tgrt_clk_div_num : R/W; bitpos: [20:5]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp0_tgrt_clk_div_num:16;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} hp_sys_clkrst_timergrp0_tgrt_ctrl0_reg_t;


/** Group: timergrp1_ctrl */
/** Type of timergrp1_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_timergrp1_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp1_apb_clk_en:1;
        /** reg_timergrp1_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp1_rst_en:1;
        /** reg_timergrp1_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp1_force_norst:1;
        /** reg_timergrp1_t0_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp1_t0_src_sel:2;
        /** reg_timergrp1_t0_clk_en : R/W; bitpos: [5]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp1_t0_clk_en:1;
        /** reg_timergrp1_t1_src_sel : R/W; bitpos: [7:6]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp1_t1_src_sel:2;
        /** reg_timergrp1_t1_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp1_t1_clk_en:1;
        /** reg_timergrp1_wdt_src_sel : R/W; bitpos: [10:9]; default: 0;
         *  need_des
         */
        uint32_t reg_timergrp1_wdt_src_sel:2;
        /** reg_timergrp1_wdt_clk_en : R/W; bitpos: [11]; default: 1;
         *  need_des
         */
        uint32_t reg_timergrp1_wdt_clk_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} hp_sys_clkrst_timergrp1_ctrl0_reg_t;


/** Group: systimer_ctrl */
/** Type of systimer_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_systimer_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_systimer_apb_clk_en:1;
        /** reg_systimer_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_systimer_rst_en:1;
        /** reg_systimer_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_systimer_force_norst:1;
        /** reg_systimer_clk_src_sel : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_systimer_clk_src_sel:1;
        /** reg_systimer_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_systimer_clk_en:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} hp_sys_clkrst_systimer_ctrl0_reg_t;


/** Group: mcpwm0_ctrl */
/** Type of mcpwm0_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mcpwm0_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm0_apb_clk_en:1;
        /** reg_mcpwm0_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm0_rst_en:1;
        /** reg_mcpwm0_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm0_force_norst:1;
        /** reg_mcpwm0_clk_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm0_clk_src_sel:2;
        /** reg_mcpwm0_clk_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm0_clk_en:1;
        /** reg_mcpwm0_clk_div_num : R/W; bitpos: [13:6]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm0_clk_div_num:8;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} hp_sys_clkrst_mcpwm0_ctrl0_reg_t;


/** Group: mcpwm1_ctrl */
/** Type of mcpwm1_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mcpwm1_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm1_apb_clk_en:1;
        /** reg_mcpwm1_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm1_rst_en:1;
        /** reg_mcpwm1_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm1_force_norst:1;
        /** reg_mcpwm1_clk_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm1_clk_src_sel:2;
        /** reg_mcpwm1_clk_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm1_clk_en:1;
        /** reg_mcpwm1_clk_div_num : R/W; bitpos: [13:6]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm1_clk_div_num:8;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} hp_sys_clkrst_mcpwm1_ctrl0_reg_t;


/** Group: mcpwm2_ctrl */
/** Type of mcpwm2_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mcpwm2_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm2_apb_clk_en:1;
        /** reg_mcpwm2_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm2_rst_en:1;
        /** reg_mcpwm2_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm2_force_norst:1;
        /** reg_mcpwm2_clk_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm2_clk_src_sel:2;
        /** reg_mcpwm2_clk_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm2_clk_en:1;
        /** reg_mcpwm2_clk_div_num : R/W; bitpos: [13:6]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm2_clk_div_num:8;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} hp_sys_clkrst_mcpwm2_ctrl0_reg_t;


