espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: mcpwm3_ctrl */
/** Type of mcpwm3_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_mcpwm3_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm3_apb_clk_en:1;
        /** reg_mcpwm3_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm3_rst_en:1;
        /** reg_mcpwm3_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm3_force_norst:1;
        /** reg_mcpwm3_clk_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm3_clk_src_sel:2;
        /** reg_mcpwm3_clk_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm3_clk_en:1;
        /** reg_mcpwm3_clk_div_num : R/W; bitpos: [13:6]; default: 0;
         *  need_des
         */
        uint32_t reg_mcpwm3_clk_div_num:8;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} hp_sys_clkrst_mcpwm3_ctrl0_reg_t;


/** Group: intrmtx_ctrl */
/** Type of intrmtx_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_intrmtx_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_intrmtx_apb_clk_en:1;
        /** reg_intrmtx_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_intrmtx_rst_en:1;
        /** reg_intrmtx_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_intrmtx_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_intrmtx_ctrl0_reg_t;


/** Group: pcnt_ctrl */
/** Type of pcnt_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_pcnt0_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_pcnt0_apb_clk_en:1;
        /** reg_pcnt0_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_pcnt0_rst_en:1;
        /** reg_pcnt0_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_pcnt0_force_norst:1;
        /** reg_pcnt1_apb_clk_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_pcnt1_apb_clk_en:1;
        /** reg_pcnt1_rst_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_pcnt1_rst_en:1;
        /** reg_pcnt1_force_norst : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_pcnt1_force_norst:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_sys_clkrst_pcnt_ctrl0_reg_t;


/** Group: usb_device_ctrl */
/** Type of usb_device_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_usb_device_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_usb_device_apb_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_usb_device_ctrl0_reg_t;


/** Group: ledc_ctrl */
/** Type of ledc_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ledc0_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc0_apb_clk_en:1;
        /** reg_ledc0_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc0_rst_en:1;
        /** reg_ledc0_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc0_force_norst:1;
        /** reg_ledc0_clk_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc0_clk_src_sel:2;
        /** reg_ledc0_clk_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc0_clk_en:1;
        /** reg_ledc1_apb_clk_en : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc1_apb_clk_en:1;
        /** reg_ledc1_rst_en : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc1_rst_en:1;
        /** reg_ledc1_force_norst : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc1_force_norst:1;
        /** reg_ledc1_clk_src_sel : R/W; bitpos: [10:9]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc1_clk_src_sel:2;
        /** reg_ledc1_clk_en : R/W; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t reg_ledc1_clk_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} hp_sys_clkrst_ledc_ctrl0_reg_t;


/** Group: lcdcam_ctrl */
/** Type of lcdcam_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_lcdcam_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_apb_clk_en:1;
        /** reg_lcdcam_apb_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_apb_rst_en:1;
        /** reg_lcdcam_sys_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_sys_clk_en:1;
        /** reg_lcdcam_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_rst_en:1;
        /** reg_lcdcam_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_force_norst:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} hp_sys_clkrst_lcdcam_ctrl0_reg_t;


/** Group: lcdcam_lcd_ctrl */
/** Type of lcdcam_lcd_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_lcd_clk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t reg_lcd_clk_src_sel:2;
        /** reg_lcd_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_lcd_clk_en:1;
        /** reg_lcd_clk_div_num : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_lcd_clk_div_num:8;
        /** reg_lcd_clk_div_numerator : R/W; bitpos: [18:11]; default: 0;
         *  need_des
         */
        uint32_t reg_lcd_clk_div_numerator:8;
        /** reg_lcd_clk_div_denominator : R/W; bitpos: [26:19]; default: 0;
         *  need_des
         */
        uint32_t reg_lcd_clk_div_denominator:8;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_lcdcam_lcd_ctrl0_reg_t;


