espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: lcdcam_lcdcam_ctrl */
/** Type of lcdcam_lcdcam_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_lcdcam_clk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_clk_src_sel:2;
        /** reg_lcdcam_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_clk_en:1;
        /** reg_lcdcam_clk_div_num : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_clk_div_num:8;
        /** reg_lcdcam_clk_div_numerator : R/W; bitpos: [18:11]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_clk_div_numerator:8;
        /** reg_lcdcam_clk_div_denominator : R/W; bitpos: [26:19]; default: 0;
         *  need_des
         */
        uint32_t reg_lcdcam_clk_div_denominator:8;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_lcdcam_lcdcam_ctrl0_reg_t;


/** Group: lcdcam_cam_ctrl */
/** Type of lcdcam_cam_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cam_clk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t reg_cam_clk_src_sel:2;
        /** reg_cam_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_cam_clk_en:1;
        /** reg_cam_clk_div_num : R/W; bitpos: [10:3]; default: 0;
         *  need_des
         */
        uint32_t reg_cam_clk_div_num:8;
        /** reg_cam_clk_div_numerator : R/W; bitpos: [18:11]; default: 0;
         *  need_des
         */
        uint32_t reg_cam_clk_div_numerator:8;
        /** reg_cam_clk_div_denominator : R/W; bitpos: [26:19]; default: 0;
         *  need_des
         */
        uint32_t reg_cam_clk_div_denominator:8;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_lcdcam_cam_ctrl0_reg_t;


/** Group: iomux_ctrl */
/** Type of iomux_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_iomux_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_iomux_apb_clk_en:1;
        /** reg_iomux_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_iomux_rst_en:1;
        /** reg_iomux_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_iomux_force_norst:1;
        /** reg_iomux_clk_src_sel : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_iomux_clk_src_sel:1;
        /** reg_iomux_clk_en : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t reg_iomux_clk_en:1;
        /** reg_iomux_clk_div_num : R/W; bitpos: [12:5]; default: 0;
         *  need_des
         */
        uint32_t reg_iomux_clk_div_num:8;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} hp_sys_clkrst_iomux_ctrl0_reg_t;


/** Group: hpwdt_core0_rst_ctrl */
/** Type of hpwdt_core0_rst_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_hpcore0_stall_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_hpcore0_stall_en:1;
        /** reg_hpcore0_stall_wait_num : R/W; bitpos: [8:1]; default: 8;
         *  need_des
         */
        uint32_t reg_hpcore0_stall_wait_num:8;
        /** reg_wdt_hpcore0_rst_len : R/W; bitpos: [16:9]; default: 8;
         *  need_des
         */
        uint32_t reg_wdt_hpcore0_rst_len:8;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_hpwdt_core0_rst_ctrl0_reg_t;


/** Group: hpwdt_core1_rst_ctrl */
/** Type of hpwdt_core1_rst_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_hpcore1_stall_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_hpcore1_stall_en:1;
        /** reg_hpcore1_stall_wait_num : R/W; bitpos: [8:1]; default: 8;
         *  need_des
         */
        uint32_t reg_hpcore1_stall_wait_num:8;
        /** reg_wdt_hpcore1_rst_len : R/W; bitpos: [16:9]; default: 8;
         *  need_des
         */
        uint32_t reg_wdt_hpcore1_rst_len:8;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_hpwdt_core1_rst_ctrl0_reg_t;


/** Group: cpu_src_freq */
/** Type of cpu_src_freq0 register
 *  CPU Source Frequency
 */
typedef union {
    struct {
        /** reg_cpu_src_freq : RO; bitpos: [31:0]; default: 0;
         *  cpu source clock frequency, step by 0.25MHz
         */
        uint32_t reg_cpu_src_freq:32;
    };
    uint32_t val;
} hp_sys_clkrst_cpu_src_freq0_reg_t;


/** Group: cpu_clk_status */
/** Type of cpu_clk_status0 register
 *  CPU Clock Status
 */
typedef union {
    struct {
        /** reg_asic_or_fpga : RO; bitpos: [0]; default: 0;
         *  0: ASIC mode, 1: FPGA mode
         */
        uint32_t reg_asic_or_fpga:1;
        /** reg_cpu_div_effect : RO; bitpos: [1]; default: 0;
         *  0: Divider bypass, 1: Divider takes effect
         */
        uint32_t reg_cpu_div_effect:1;
        /** reg_cpu_src_is_cpll : RO; bitpos: [2]; default: 0;
         *  0: CPU source isn't cpll_400m, 1: CPU Source is cll_400m
         */
        uint32_t reg_cpu_src_is_cpll:1;
        /** reg_cpu_div_num_cur : RO; bitpos: [10:3]; default: 0;
         *  cpu current div number
         */
        uint32_t reg_cpu_div_num_cur:8;
        /** reg_cpu_div_numerator_cur : RO; bitpos: [13:11]; default: 0;
         *  cpu current div numerator
         */
        uint32_t reg_cpu_div_numerator_cur:3;
        /** reg_cpu_div_denominator_cur : RO; bitpos: [16:14]; default: 0;
         *  cpu current div denominator
         */
        uint32_t reg_cpu_div_denominator_cur:3;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_cpu_clk_status0_reg_t;


/** Group: hpcore_wdt_reset_source */
/** Type of hpcore_wdt_reset_source0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_hpcore0_wdt_reset_source_sel : R/W; bitpos: [0]; default: 0;
         *  1'b0: use wdt0 to reset hpcore0, 1'b1: use wdt1 to reset hpcore0
         */
        uint32_t reg_hpcore0_wdt_reset_source_sel:1;
        /** reg_hpcore1_wdt_reset_source_sel : R/W; bitpos: [1]; default: 1;
         *  1'b0: use wdt0 to reset hpcore1, 1'b1: use wdt1 to reset hpcore1
         */
        uint32_t reg_hpcore1_wdt_reset_source_sel:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_sys_clkrst_hpcore_wdt_reset_source0_reg_t;


/** Group: ana_pll_ctrl */
/** Type of ana_pll_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_plla_cal_end : RO; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_plla_cal_end:1;
        /** reg_plla_cal_stop : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_plla_cal_stop:1;
        /** reg_cpu_pll_cal_end : RO; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_pll_cal_end:1;
        /** reg_cpu_pll_cal_stop : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_pll_cal_stop:1;
        /** reg_sdio_pll_cal_end : RO; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_pll_cal_end:1;
        /** reg_sdio_pll_cal_stop : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_sdio_pll_cal_stop:1;
        /** reg_bbpll_cal_end : RO; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t reg_bbpll_cal_end:1;
        /** reg_bbpll_cal_stop : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_bbpll_cal_stop:1;
        /** reg_mspi_cal_end : RO; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t reg_mspi_cal_end:1;
        /** reg_mspi_cal_stop : R/W; bitpos: [9]; default: 0;
         *  need_des
         */
        uint32_t reg_mspi_cal_stop:1;
        /** reg_pll_cal_end : RO; bitpos: [10]; default: 0;
         *  need_des
         */
        uint32_t reg_pll_cal_end:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_sys_clkrst_ana_pll_ctrl0_reg_t;


/** Group: ref_500m_ctrl */
/** Type of ref_500m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_500m_sel : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_ref_500m_sel:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_ref_500m_ctrl0_reg_t;


