espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: ref_240m_ctrl */
/** Type of ref_240m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_240m_clk_div_num : R/W; bitpos: [7:0]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_240m_clk_div_num:8;
        /** reg_ref_240m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_240m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_ref_240m_ctrl0_reg_t;


/** Group: ref_160m_ctrl */
/** Type of ref_160m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_160m_clk_div_num : R/W; bitpos: [7:0]; default: 2;
         *  need_des
         */
        uint32_t reg_ref_160m_clk_div_num:8;
        /** reg_ref_160m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_160m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_ref_160m_ctrl0_reg_t;


/** Group: ref_120m_ctrl */
/** Type of ref_120m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_120m_clk_div_num : R/W; bitpos: [7:0]; default: 3;
         *  need_des
         */
        uint32_t reg_ref_120m_clk_div_num:8;
        /** reg_ref_120m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_120m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_ref_120m_ctrl0_reg_t;


/** Group: ref_80m_ctrl */
/** Type of ref_80m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_80m_clk_div_num : R/W; bitpos: [7:0]; default: 5;
         *  need_des
         */
        uint32_t reg_ref_80m_clk_div_num:8;
        /** reg_ref_80m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_80m_clk_en:1;
        /** reg_ref_80m_sel : R/W; bitpos: [9]; default: 0;
         *  need_des
         */
        uint32_t reg_ref_80m_sel:1;
        /** reg_ref_80m_mux_clk_en : R/W; bitpos: [10]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_80m_mux_clk_en:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_sys_clkrst_ref_80m_ctrl0_reg_t;


/** Group: ref_60m_ctrl */
/** Type of ref_60m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_60m_clk_div_num : R/W; bitpos: [7:0]; default: 7;
         *  need_des
         */
        uint32_t reg_ref_60m_clk_div_num:8;
        /** reg_ref_60m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_60m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_ref_60m_ctrl0_reg_t;


/** Group: ref_20m_ctrl */
/** Type of ref_20m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_20m_clk_div_num : R/W; bitpos: [7:0]; default: 23;
         *  need_des
         */
        uint32_t reg_ref_20m_clk_div_num:8;
        /** reg_ref_20m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_20m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_ref_20m_ctrl0_reg_t;


/** Group: ref_50m_ctrl */
/** Type of ref_50m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_50m_clk_div_num : R/W; bitpos: [7:0]; default: 5;
         *  need_des
         */
        uint32_t reg_ref_50m_clk_div_num:8;
        /** reg_ref_50m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_50m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_ref_50m_ctrl0_reg_t;


/** Group: ref_25m_ctrl */
/** Type of ref_25m_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ref_25m_clk_div_num : R/W; bitpos: [7:0]; default: 11;
         *  need_des
         */
        uint32_t reg_ref_25m_clk_div_num:8;
        /** reg_ref_25m_clk_en : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t reg_ref_25m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_ref_25m_ctrl0_reg_t;


/** Group: tm_clk_ctrl */
/** Type of tm_clk_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_tm_480m_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_480m_clk_en:1;
        /** reg_tm_240m_clk_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_240m_clk_en:1;
        /** reg_tm_160m_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_160m_clk_en:1;
        /** reg_tm_120m_clk_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_120m_clk_en:1;
        /** reg_tm_80m_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_80m_clk_en:1;
        /** reg_tm_60m_clk_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_60m_clk_en:1;
        /** reg_tm_48m_clk_en : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_48m_clk_en:1;
        /** reg_tm_20m_clk_en : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_20m_clk_en:1;
        /** reg_tm_250m_clk_en : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t reg_tm_250m_clk_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_tm_clk_ctrl0_reg_t;


/** Group: dbg0_clk_ctrl */
/** Type of dbg0_clk_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_dbg_ch0_sel : R/W; bitpos: [7:0]; default: 255;
         *  need_des
         */
        uint32_t reg_dbg_ch0_sel:8;
        /** reg_dbg_ch0_div_num : R/W; bitpos: [15:8]; default: 3;
         *  need_des
         */
        uint32_t reg_dbg_ch0_div_num:8;
        /** reg_dbg_ch0_en : R/W; bitpos: [16]; default: 0;
         *  need_des
         */
        uint32_t reg_dbg_ch0_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_dbg0_clk_ctrl0_reg_t;


/** Group: dbg1_clk_ctrl */
/** Type of dbg1_clk_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_dbg_ch1_sel : R/W; bitpos: [7:0]; default: 255;
         *  need_des
         */
        uint32_t reg_dbg_ch1_sel:8;
        /** reg_dbg_ch1_div_num : R/W; bitpos: [15:8]; default: 3;
         *  need_des
         */
        uint32_t reg_dbg_ch1_div_num:8;
        /** reg_dbg_ch1_en : R/W; bitpos: [16]; default: 0;
         *  need_des
         */
        uint32_t reg_dbg_ch1_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_dbg1_clk_ctrl0_reg_t;


/** Group: dbg2_clk_ctrl */
/** Type of dbg2_clk_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_dbg_ch2_sel : R/W; bitpos: [7:0]; default: 255;
         *  need_des
         */
        uint32_t reg_dbg_ch2_sel:8;
        /** reg_dbg_ch2_div_num : R/W; bitpos: [15:8]; default: 3;
         *  need_des
         */
        uint32_t reg_dbg_ch2_div_num:8;
        /** reg_dbg_ch2_en : R/W; bitpos: [16]; default: 0;
         *  need_des
         */
        uint32_t reg_dbg_ch2_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_dbg2_clk_ctrl0_reg_t;


/** Group: lp_clk_ctrl */
/** Type of lp_clk_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_lpaon_fosc_clk_force_on : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_lpaon_fosc_clk_force_on:1;
        /** reg_lpaon_xtal_clk_force_on : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_lpaon_xtal_clk_force_on:1;
        /** reg_lpaon_pll80m_clk_force_on : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_lpaon_pll80m_clk_force_on:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_lp_clk_ctrl0_reg_t;


