espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: ahb_asrc_ctrl */
/** Type of ahb_asrc_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_ahb_asrc_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_ahb_asrc_sys_clk_en:1;
        /** reg_ahb_asrc_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_ahb_asrc_rst_en:1;
        /** reg_ahb_asrc_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_ahb_asrc_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_ahb_asrc_ctrl0_reg_t;


/** Group: cordic_ctrl */
/** Type of cordic_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cordic_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_apb_clk_en:1;
        /** reg_cordic_apb_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_apb_rst_en:1;
        /** reg_cordic_sys_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_sys_clk_en:1;
        /** reg_cordic_sys_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_sys_rst_en:1;
        /** reg_cordic_clk_en : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_clk_en:1;
        /** reg_cordic_core_rst_en : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_core_rst_en:1;
        /** reg_cordic_force_norst : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_force_norst:1;
        /** reg_cordic_clk_src_sel : R/W; bitpos: [8:7]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_clk_src_sel:2;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_cordic_ctrl0_reg_t;

/** Type of cordic_ctrl1 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cordic_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_clk_div_num:8;
        /** reg_cordic_clk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_clk_div_numerator:8;
        /** reg_cordic_clk_div_denonimator : R/W; bitpos: [23:16]; default: 0;
         *  need_des
         */
        uint32_t reg_cordic_clk_div_denonimator:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} hp_sys_clkrst_cordic_ctrl1_reg_t;


/** Group: zero_det_ctrl */
/** Type of zero_det_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_zero_det_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t reg_zero_det_apb_clk_en:1;
        /** reg_zero_det_apb_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_zero_det_apb_rst_en:1;
        /** reg_zero_det_clk_en : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_zero_det_clk_en:1;
        /** reg_zero_det_core_rst_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t reg_zero_det_core_rst_en:1;
        /** reg_zero_det_force_norst : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t reg_zero_det_force_norst:1;
        /** reg_zero_det_clk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  need_des
         */
        uint32_t reg_zero_det_clk_src_sel:2;
        /** reg_zero_det_clk_div_num : R/W; bitpos: [14:7]; default: 0;
         *  need_des
         */
        uint32_t reg_zero_det_clk_div_num:8;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} hp_sys_clkrst_zero_det_ctrl0_reg_t;


/** Group: power_ctrl */
/** Type of clk_pwr_decrease register
 *  need_des
 */
typedef union {
    struct {
        /** reg_apb_hw_decrease_div_num : R/W; bitpos: [7:0]; default: 0;
         *  need_des
         */
        uint32_t reg_apb_hw_decrease_div_num:8;
        /** reg_cpu_wfi_decrease_en : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t reg_cpu_wfi_decrease_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_sys_clkrst_clk_pwr_decrease_reg_t;


/** Group: cnnt_iomux_ctrl */
/** Type of cnnt_iomux_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cnnt_iomux_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  cnnt_iomux clk en
         */
        uint32_t reg_cnnt_iomux_apb_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_cnnt_iomux_ctrl0_reg_t;


/** Group: hp_i2cmst_ctrl */
/** Type of hp_i2cmst_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_hp_i2cmst_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_hp_i2cmst_apb_clk_en:1;
        /** reg_hp_i2cmst_rst_en : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t reg_hp_i2cmst_rst_en:1;
        /** reg_hp_i2cmst_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_hp_i2cmst_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_hp_i2cmst_ctrl0_reg_t;


/** Group: axi_perf_mon_ctrl */
/** Type of axi_perf_mon_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_axi_perf_mon_rst_en : R/W; bitpos: [0]; default: 0;
         *  axi_perf_mon rst en
         */
        uint32_t reg_axi_perf_mon_rst_en:1;
        /** reg_axi_perf_mon_clk_en : R/W; bitpos: [1]; default: 0;
         *  axi_perf_mon clk en
         */
        uint32_t reg_axi_perf_mon_clk_en:1;
        /** reg_axi_perf_mon_force_norst : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t reg_axi_perf_mon_force_norst:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_axi_perf_mon_ctrl0_reg_t;


/** Group: cnnt_sysreg_ctrl */
/** Type of cnnt_sysreg_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_cnnt_sysreg_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  cnnt_sysreg clk en
         */
        uint32_t reg_cnnt_sysreg_sys_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_cnnt_sysreg_ctrl0_reg_t;


