espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_struct.h
/** Group: hp alive_sysreg_ctrl */
/** Type of hp_alive_sysreg_ctrl0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_hp_alive_sysreg_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  hp alive_sysreg clk en
         */
        uint32_t reg_hp_alive_sysreg_apb_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_hp_alive_sysreg_ctrl0_reg_t;


/** Group: Configuration Register */
/** Type of modem_conf register
 *  MODEM_APB configuration register
 */
typedef union {
    struct {
        /** modem_apb_clk_en : R/W; bitpos: [0]; default: 1;
         *  This field indicates if modem_apb clock is enable. 0: disable, 1: enable(default).
         */
        uint32_t modem_apb_clk_en:1;
        /** modem_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set this file as 1 to reset modem-subsystem.
         */
        uint32_t modem_rst_en:1;
        /** modem_clk_en : R/W; bitpos: [2]; default: 1;
         *  This field indicates if modem source clock is enable. 0: disable, 1:
         *  enable(default).
         */
        uint32_t modem_clk_en:1;
        /** modem_clk_source_sel : R/W; bitpos: [3]; default: 0;
         *  modem clk source sel
         */
        uint32_t modem_clk_source_sel:1;
        /** modem_pll_clk_en : R/W; bitpos: [4]; default: 0;
         *  modem clk source pll on
         */
        uint32_t modem_pll_clk_en:1;
        /** modem_xtal_clk_en : R/W; bitpos: [5]; default: 1;
         *  modem clk source xtal on
         */
        uint32_t modem_xtal_clk_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_sys_clkrst_modem_conf_reg_t;


/** Group: clk_en */
/** Type of clk_en0 register
 *  need_des
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_clk_en0_reg_t;


/** Group: date_reg */
/** Type of date register
 *  need_des
 */
typedef union {
    struct {
        /** reg_date : R/W; bitpos: [27:0]; default: 38834448;
         *  Version control register
         */
        uint32_t reg_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_sys_clkrst_date_reg_t;


typedef struct {
    volatile hp_sys_clkrst_soc_clk_sel_reg_t soc_clk_sel;
    volatile hp_sys_clkrst_cpu_freq_ctrl0_reg_t cpu_freq_ctrl0;
    volatile hp_sys_clkrst_mem_freq_ctrl0_reg_t mem_freq_ctrl0;
    volatile hp_sys_clkrst_sys_freq_ctrl0_reg_t sys_freq_ctrl0;
    volatile hp_sys_clkrst_apb_freq_ctrl0_reg_t apb_freq_ctrl0;
    volatile hp_sys_clkrst_root_clk_ctrl0_reg_t root_clk_ctrl0;
    volatile hp_sys_clkrst_cpu_wfi_delay_ctrl0_reg_t cpu_wfi_delay_ctrl0;
    volatile hp_sys_clkrst_hpcore0_ctrl0_reg_t hpcore0_ctrl0;
    volatile hp_sys_clkrst_hpcore1_ctrl0_reg_t hpcore1_ctrl0;
    volatile hp_sys_clkrst_trace_ctrl0_reg_t trace_ctrl0;
    volatile hp_sys_clkrst_tcm_ctrl0_reg_t tcm_ctrl0;
    volatile hp_sys_clkrst_tcmmon_ctrl0_reg_t tcmmon_ctrl0;
    volatile hp_sys_clkrst_psrammon_ctrl0_reg_t psrammon_ctrl0;
    volatile hp_sys_clkrst_rom_ctrl0_reg_t rom_ctrl0;
    volatile hp_sys_clkrst_cache_ctrl0_reg_t cache_ctrl0;
    volatile hp_sys_clkrst_icm_ctrl0_reg_t icm_ctrl0;
    volatile hp_sys_clkrst_modem_ctrl0_reg_t modem_ctrl0;
    volatile hp_sys_clkrst_misc_ctrl0_reg_t misc_ctrl0;
    volatile hp_sys_clkrst_busmon_ctrl0_reg_t busmon_ctrl0;
    volatile hp_sys_clkrst_remove_tmp0_reg_t remove_tmp0;
    volatile hp_sys_clkrst_pvt0_ctrl0_reg_t pvt0_ctrl0;
    volatile hp_sys_clkrst_pvt0_peri_ctrl0_reg_t pvt0_peri_ctrl0;
    volatile hp_sys_clkrst_crypto_ctrl0_reg_t crypto_ctrl0;
    volatile hp_sys_clkrst_key_manager_ctrl0_reg_t key_manager_ctrl0;
    volatile hp_sys_clkrst_dpa_ctrl0_reg_t dpa_ctrl0;
    volatile hp_sys_clkrst_flash_ctrl0_reg_t flash_ctrl0;
    volatile hp_sys_clkrst_psram_ctrl0_reg_t psram_ctrl0;
    volatile hp_sys_clkrst_gpspi2_ctrl0_reg_t gpspi2_ctrl0;
    volatile hp_sys_clkrst_gpspi3_ctrl0_reg_t gpspi3_ctrl0;
    volatile hp_sys_clkrst_gdma_ctrl0_reg_t gdma_ctrl0;
    volatile hp_sys_clkrst_axi_pdma_ctrl0_reg_t axi_pdma_ctrl0;
    volatile hp_sys_clkrst_ahb_pdma_ctrl0_reg_t ahb_pdma_ctrl0;
    volatile hp_sys_clkrst_regdma_ctrl0_reg_t regdma_ctrl0;
    volatile hp_sys_clkrst_uhci_ctrl0_reg_t uhci_ctrl0;
    volatile hp_sys_clkrst_uart0_ctrl0_reg_t uart0_ctrl0;
    volatile hp_sys_clkrst_uart1_ctrl0_reg_t uart1_ctrl0;
    volatile hp_sys_clkrst_uart2_ctrl0_reg_t uart2_ctrl0;
    volatile hp_sys_clkrst_uart3_ctrl0_reg_t uart3_ctrl0;
    volatile hp_sys_clkrst_parlio_ctrl0_reg_t parlio_ctrl0;
    volatile hp_sys_clkrst_parlio_rx_ctrl0_reg_t parlio_rx_ctrl0;
    volatile hp_sys_clkrst_parlio_tx_ctrl0_reg_t parlio_tx_ctrl0;
    volatile hp_sys_clkrst_bitsrambler_ctrl0_reg_t bitsrambler_ctrl0;
    volatile hp_sys_clkrst_etm_ctrl0_reg_t etm_ctrl0;
    volatile hp_sys_clkrst_usb_otghs_ctrl0_reg_t usb_otghs_ctrl0;
    volatile hp_sys_clkrst_dma2d_ctrl0_reg_t dma2d_ctrl0;
    volatile hp_sys_clkrst_ppa_ctrl0_reg_t ppa_ctrl0;
    volatile hp_sys_clkrst_jpeg_ctrl0_reg_t jpeg_ctrl0;
    volatile hp_sys_clkrst_rmt_ctrl0_reg_t rmt_ctrl0;
    volatile hp_sys_clkrst_sdio_host_ctrl0_reg_t sdio_host_ctrl0;
    volatile hp_sys_clkrst_sdio_host_func_ctrl0_reg_t sdio_host_func_ctrl0;
    volatile hp_sys_clkrst_emac_ctrl0_reg_t emac_ctrl0;
    volatile hp_sys_clkrst_dsi_ctrl0_reg_t dsi_ctrl0;
    volatile hp_sys_clkrst_dsi_phy_ctrl0_reg_t dsi_phy_ctrl0;
    volatile hp_sys_clkrst_dsi_dpi_ctrl0_reg_t dsi_dpi_ctrl0;
    volatile hp_sys_clkrst_mspi_pad_ctrl0_reg_t mspi_pad_ctrl0;
    volatile hp_sys_clkrst_i2c0_ctrl0_reg_t i2c0_ctrl0;
    volatile hp_sys_clkrst_i2c1_ctrl0_reg_t i2c1_ctrl0;
    volatile hp_sys_clkrst_i2s0_ctrl0_reg_t i2s0_ctrl0;
    volatile hp_sys_clkrst_i2s0_rx_ctrl0_reg_t i2s0_rx_ctrl0;
    volatile hp_sys_clkrst_i2s0_rx_div_ctrl0_reg_t i2s0_rx_div_ctrl0;
    volatile hp_sys_clkrst_i2s0_tx_ctrl0_reg_t i2s0_tx_ctrl0;
    volatile hp_sys_clkrst_i2s0_tx_div_ctrl0_reg_t i2s0_tx_div_ctrl0;
    volatile hp_sys_clkrst_i2s1_ctrl0_reg_t i2s1_ctrl0;
    volatile hp_sys_clkrst_i2s1_rx_ctrl0_reg_t i2s1_rx_ctrl0;
    volatile hp_sys_clkrst_i2s1_rx_div_ctrl0_reg_t i2s1_rx_div_ctrl0;
    volatile hp_sys_clkrst_i2s1_tx_ctrl0_reg_t i2s1_tx_ctrl0;
    volatile hp_sys_clkrst_i2s1_tx_div_ctrl0_reg_t i2s1_tx_div_ctrl0;
    volatile hp_sys_clkrst_twai0_ctrl0_reg_t twai0_ctrl0;
    volatile hp_sys_clkrst_twai1_ctrl0_reg_t twai1_ctrl0;
    volatile hp_sys_clkrst_timergrp0_ctrl0_reg_t timergrp0_ctrl0;
    volatile hp_sys_clkrst_timergrp0_tgrt_ctrl0_reg_t timergrp0_tgrt_ctrl0;
    volatile hp_sys_clkrst_timergrp1_ctrl0_reg_t timergrp1_ctrl0;
    volatile hp_sys_clkrst_systimer_ctrl0_reg_t systimer_ctrl0;
    volatile hp_sys_clkrst_mcpwm0_ctrl0_reg_t mcpwm0_ctrl0;
    volatile hp_sys_clkrst_mcpwm1_ctrl0_reg_t mcpwm1_ctrl0;
    volatile hp_sys_clkrst_mcpwm2_ctrl0_reg_t mcpwm2_ctrl0;
    volatile hp_sys_clkrst_mcpwm3_ctrl0_reg_t mcpwm3_ctrl0;
    volatile hp_sys_clkrst_intrmtx_ctrl0_reg_t intrmtx_ctrl0;
    volatile hp_sys_clkrst_pcnt_ctrl0_reg_t pcnt_ctrl0;
    uint32_t reserved_13c[2];
    volatile hp_sys_clkrst_usb_device_ctrl0_reg_t usb_device_ctrl0;
    volatile hp_sys_clkrst_ledc_ctrl0_reg_t ledc_ctrl0;
    volatile hp_sys_clkrst_lcdcam_ctrl0_reg_t lcdcam_ctrl0;
    volatile hp_sys_clkrst_lcdcam_lcd_ctrl0_reg_t lcdcam_lcd_ctrl0;
    volatile hp_sys_clkrst_lcdcam_lcdcam_ctrl0_reg_t lcdcam_lcdcam_ctrl0;
    volatile hp_sys_clkrst_lcdcam_cam_ctrl0_reg_t lcdcam_cam_ctrl0;
    volatile hp_sys_clkrst_iomux_ctrl0_reg_t iomux_ctrl0;
    volatile hp_sys_clkrst_hpwdt_core0_rst_ctrl0_reg_t hpwdt_core0_rst_ctrl0;
    volatile hp_sys_clkrst_hpwdt_core1_rst_ctrl0_reg_t hpwdt_core1_rst_ctrl0;
    volatile hp_sys_clkrst_cpu_src_freq0_reg_t cpu_src_freq0;
    volatile hp_sys_clkrst_cpu_clk_status0_reg_t cpu_clk_status0;
    volatile hp_sys_clkrst_hpcore_wdt_reset_source0_reg_t hpcore_wdt_reset_source0;
    volatile hp_sys_clkrst_ana_pll_ctrl0_reg_t ana_pll_ctrl0;
    volatile hp_sys_clkrst_ref_500m_ctrl0_reg_t ref_500m_ctrl0;
    volatile hp_sys_clkrst_ref_240m_ctrl0_reg_t ref_240m_ctrl0;
    volatile hp_sys_clkrst_ref_160m_ctrl0_reg_t ref_160m_ctrl0;
    volatile hp_sys_clkrst_ref_120m_ctrl0_reg_t ref_120m_ctrl0;
    volatile hp_sys_clkrst_ref_80m_ctrl0_reg_t ref_80m_ctrl0;
    volatile hp_sys_clkrst_ref_60m_ctrl0_reg_t ref_60m_ctrl0;
    volatile hp_sys_clkrst_ref_20m_ctrl0_reg_t ref_20m_ctrl0;
    volatile hp_sys_clkrst_ref_50m_ctrl0_reg_t ref_50m_ctrl0;
    volatile hp_sys_clkrst_ref_25m_ctrl0_reg_t ref_25m_ctrl0;
    volatile hp_sys_clkrst_tm_clk_ctrl0_reg_t tm_clk_ctrl0;
    volatile hp_sys_clkrst_dbg0_clk_ctrl0_reg_t dbg0_clk_ctrl0;
    volatile hp_sys_clkrst_dbg1_clk_ctrl0_reg_t dbg1_clk_ctrl0;
    volatile hp_sys_clkrst_dbg2_clk_ctrl0_reg_t dbg2_clk_ctrl0;
    volatile hp_sys_clkrst_lp_clk_ctrl0_reg_t lp_clk_ctrl0;
    volatile hp_sys_clkrst_ahb_asrc_ctrl0_reg_t ahb_asrc_ctrl0;
    volatile hp_sys_clkrst_cordic_ctrl0_reg_t cordic_ctrl0;
    volatile hp_sys_clkrst_zero_det_ctrl0_reg_t zero_det_ctrl0;
    volatile hp_sys_clkrst_cordic_ctrl1_reg_t cordic_ctrl1;
    uint32_t reserved_1c0[2];
    volatile hp_sys_clkrst_clk_pwr_decrease_reg_t clk_pwr_decrease;
    volatile hp_sys_clkrst_cnnt_iomux_ctrl0_reg_t cnnt_iomux_ctrl0;
    volatile hp_sys_clkrst_hp_i2cmst_ctrl0_reg_t hp_i2cmst_ctrl0;
    volatile hp_sys_clkrst_axi_perf_mon_ctrl0_reg_t axi_perf_mon_ctrl0;
    volatile hp_sys_clkrst_cnnt_sysreg_ctrl0_reg_t cnnt_sysreg_ctrl0;
    volatile hp_sys_clkrst_hp_alive_sysreg_ctrl0_reg_t hp_alive_sysreg_ctrl0;
    volatile hp_sys_clkrst_modem_conf_reg_t modem_conf;
    uint32_t reserved_1e4[5];
    volatile hp_sys_clkrst_clk_en0_reg_t clk_en0;
    volatile hp_sys_clkrst_date_reg_t date;
} hp_sys_clkrst_dev_t;

extern hp_sys_clkrst_dev_t HP_SYS_CLKRST;

#ifndef __cplusplus
_Static_assert(sizeof(hp_sys_clkrst_dev_t) == 0x200, "Invalid size of hp_sys_clkrst_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
